// TODO: {0 = beach, 1 = forest, 2 = city, 3 = resturent, 4 = hotel}

List<Map<String, dynamic>> placesData = [
  //TODO: Beach
  {
    "category": 0,
    "description":
        "\t\tกาะลิบงเป็นเกาะที่ใหญ่ที่สุดของจังหวัดตรัง ซึ่งใช้เวลาเดินทางจากท่าเทียบเรือหาดยาวบ้านเจ้าไหมด้วยเรือหางยาวเป็นเวลา 30 นาที\n\t\tเกาะลิบงเป็นที่รู้จักจากพันธุ์สัตว์ที่ชายหาด และเป็นที่อยู่ของชุมชนประมงมุสลิมขนาดเล็กกับรีสอร์ทบางส่วนที่ชายฝั่งทางตะวันตก\n\t\tส่วนฝั่งตะวันออกของเกาะลิบงมีป่าชายเลนขนาดใหญ่ในเขตอนุรักษ์พันธุ์สัตว์ป่าหมู่เกาะลิบงของกรมทรัพยากรทางทะเลและชายฝั่ง\n",
    "image": "",
    "latitude": "7.2382662",
    "longitude": "99.3703285",
    "located": "ตำบลเกาะลิบง",
    "name": "เกาะลิบง",
    "score": 0
  },
  {
    "category": 0,
    "description":
        "\t\tพื้นที่บนเกาะกระดานแบ่งเป็น 2 ส่วน คือ ส่วนของเขตอุทยานแห่งชาติหาดเจ้าไหมและส่วนของเอกชน พื้นที่ส่วนใหญ่อยู่ในเขตความรับผิดชอบของหน่วยพิทักษ์อุทยานแห่งชาติหาดเจ้าไหมที่ 3 (เกาะกระดาน) ทางด้านตะวันออกเป็นสวนยาง สวนมะพร้าว และสถานตากอากาศของเอกชนด้วยความที่อยู่ไกลจากชายฝั่งจึงทำให้เกาะกระดานมีน้ำทะเลเขียวใส มีแนวชายหาดเกือบรอบเกาะเหมาะกับการเล่นน้ำ จึงเคยได้รับเลือกให้เป็นสถานที่จัดงานวิวาห์ใต้สมุทรของจังหวัดตรัง เกาะกระดานอยู่ทางด้านตะวันตกของเกาะมุกและเกาะลิบง",
    "image": "",
    "latitude": "7.3163743",
    "longitude": "99.2530745",
    "located": "ตำบลเกาะลิบง",
    "name": "เกาะกระดาน",
    "score": 0
  },
  {
    "category": 0,
    "description":
        "\t\tหาดปากเมง อยู่ห่างตัวอำเภอเมืองตรังประมาณ 35 กิโลเมตร เป็นชายหาดรูปพระจันทร์เสี้ยวติดช่องแคบมะละกาของมหาสมุทรอินเดีย เมื่อน้ำลดลงต่ำสุดจะมีความกว้างขวาง 500 เมตร จนสามารถขับรถยนต์ลงไปได้ เพราะทรายมีความหนาแน่นเพียงพอที่จะรองรับน้ำหนักรถได้ มีจุดสังเกต คือ เขารูปคล้ายคนขนาดยักษ์นอนหงายอยู่ มีชื่อเรียกว่า \"เขาเมง\" หรือ \"เกาะเมง\" อันที่มาของชื่อเรียก ซึ่งมาจากนิทานพื้นบ้านเรื่องของเฒ่าเมง ผู้เฒ่าชาวประมงที่กำลังจะแต่งงานลูกสาวชื่อ มุก กับพระยาลันตา มีความงามอย่างยิ่งยามพระอาทิตย์ตก ขนาบด้วยแนวต้นสนทะเลยาว 5 กิโลเมตร ถัดออกไปทางอุทยานแห่งชาติหาดเจ้าไหมยังมีสะพานคอนกรีต 2 แห่ง ที่นิยมใช้เป็นสถานที่ตกปลาอีกด้วย",
    "image": "",
    "latitude": "7.4864784",
    "longitude": "99.3251264",
    "located": "ตำบลไม้ฝาด",
    "name": "หาดปากเมง",
    "score": 0
  },
  {
    "category": 0,
    "description":
        "\t\tเกาะไหง เป็นเกาะยอดฮิต ที่ตั้งอยู่ในเขตอุทยานแห่งชาติหมู่เกาะลันตา อยู่ตรงเขตรอยต่อของ จังหวัดกระบี่ และ จังหวัดตรัง เป็นชายหาดที่เงียบสงบ และสวยงามมากๆ ผืนทรายมีสีขาวเนียนละเอียด และมีแนวปะการังที่ปลายเกาะ ทำให้ที่นี่เรียกได้ว่าสวรรค์ของนักดำน้ำเลยทีเดียว ซึ่งจุดดำน้ำก็อยู่ห่างจากชายหาดไม่ไกล และยังมีที่พักให้บริการนักท่องเที่ยวที่อยากมาค้างคืน สัมผัสธรรมชาติบนเกาะไหงอย่างใกล้ชิดอีกด้วย",
    "image": "",
    "latitude": "7.4545197",
    "longitude": "99.120763",
    "located": "ตำบลไม้ฝาด",
    "name": "เกาะไหง",
    "score": 0
  },
  {
    "category": 0,
    "description":
        "\t\tหาดหยงหลิง ตั้งอยู่ในหน่วยพิทักษ์ 2 ของอุทยานแห่งชาติเจ้าไหม เป็นบริเวณของหาดทรายโค้ง มีทิวของสนทะเลขนาดใหญ่เต็มอยู่ทั่วทั้งพื้นที่ บรรยากาศที่ร่มรื่นเงียบสงบ อีกทั้งมี เขาหยงหลิง เขาหินปูนรูปทรงแปลกตา ที่มีหน้าผาสูงชัน รวมถึงมีโพรงอยู่ตรงถ้ำ ยิ่งในช่วงที่น้ำลดเราสามารถเดินลอดได้",
    "image": "",
    "latitude": "7.3406081",
    "longitude": "99.370192",
    "located": "ตำบลกันตัง",
    "name": "หาดหยงหลิง",
    "score": 0
  },
  //TODO: Forest
  {
    "category": 1,
    "description":
        "\t\tถ้ำเลเขากอบ ที่เที่ยวธรรมชาติที่สวยงาม ภายในถ้ำมีหินงอกหินย้อย ระยะทางยาวกว่า 4 กิโลเมตร และมีทางน้ำใต้ดินไหลผ่าน ทำให้วิธีการเข้าชมถ้ำต้องนั่งเรือล่องไปตามลำน้ำเพื่อเข้าไปด้านใน ",
    "image": "",
    "latitude": "7.793718",
    "longitude": "99.5722032",
    "located": "ตำบลเขากอบ",
    "name": "ถ้ำเลเขากอบ",
    "score": 0
  },
  {
    "category": 1,
    "description":
        "\t\tเขาจมป่า ที่สามารถชมวิวของทั้งป่าโกงกางสีเขียวผืนใหญ่ตัดสสลับกับคลองได้อย่างสวยงาม เหตุที่เรียกว่าเขาจมป่า ก็เพราะภูเขาลูกนี้จะถูกป่าโกงกางบดบังเอาไว้ เหมือนกับจมอยู่ในป่านั่นเอง นอกจากภูเขาที่สามารถชมวิวสวยๆ ลับๆ ของป่านี้แล้ว ก็ยังมี สันหลังมังกร ให้ได้เที่ยวกันอีกด้วย",
    "image": "",
    "latitude": "7.3788692",
    "longitude": "99.3699311",
    "located": "ตำบลบางสัก",
    "name": "เขาจมป่า",
    "score": 0
  },
  {
    "category": 1,
    "description":
        "\t\tสวนพฤษศาสตร์ภาคใต้ ( ทุ่งค่าย ) เป็นผืนป่าที่รวบรวมพันธุ์ไม้ท้องถิ่นต่างๆ ของภาคใต้เอาไว้ ไฮไลท์ของที่นี่ จะอยู่ที่การเดินชมวิวยอดของต้นไม้บนเส้นทางสะพานเรือนยอดไม้ ที่มีหลายระดับความสูง โดยมีจุดเชื่อมของแต่ละจุดเป็นหอชมพรรณไม้กว่า 6 หอด้วยกัน โดยในช่วงฤดูไม้ใบผลิถือว่าเป็นไฮไลท์เลย เพราะต้นไม้กำลังออกดอก ออกใบอย่างสวยงาม",
    "image": "",
    "latitude": "7.4680593",
    "longitude": "99.6383106",
    "located": "ตำบลทุ่งค่าย",
    "name": "สวนพฤกษศาสตร์ภาคใต้ ทุ่งค่าย",
    "score": 0
  },
  {
    "category": 1,
    "description":
        "\t\tถ้ำเขาช้างหาย เป็นถ้ำที่มีขนาดใหญ่ มีความสูงจากพื้นดิน 150 เมตร ความยาว 850 เมตร และแบ่งเป็นโถงย่อยได้ทั้งหมด 6 ถ้ำด้วยกัน คือ ถ้ำเขาช้างหาย ถ้ำเพกา ถ้ำทรายทอง ถ้ำโอ่ง ถ้ำแม่เฒ่าคล้าย ถ้ำลม",
    "image": "",
    "latitude": "7.5899603",
    "longitude": "99.6691158",
    "located": "ตำบลนาหมื่นศรี",
    "name": "ถ้ำเขาช้างหาย",
    "score": 0
  },
  {
    "category": 1,
    "description":
        "\t\tวังผาเมฆ ตั้งอยู่บนระดับความสูงกว่า 1,600 เมตร สามารถชมวิวของทะเลหมอกบนยอดเขาได้อย่างสวยงาม แถมยังมองเห็นได้ทั้งทะเลอันดามันและเกาะต่างๆ ในจังหวัดกระบี่ เขาเจ็ดยอด และชายหาดของจังหวัดตรังได้ด้วย",
    "image": "",
    "latitude": "7.6584716",
    "longitude": "99.3612781",
    "located": "ตำบลวังมะปราง",
    "name": "วังผาเมฆ",
    "score": 0
  },
  //TODO: City
  {
    "category": 2,
    "description":
        "\t\tคริสตจักรตรัง โบสถ์คริสต์เก่าแก่อายุเกือบร้อยปี ความโดดเด่นของที่นี่คืออาคารสีเหลืองสีปูนปั้น บริเวณรอบๆ จะเป็นสวนหย่อมสวยงาม เราสามารถไปเดินเล่น ถ่ายรูปรอบๆ ได้ โบสถ์จะเปิดทุกๆ วันอาทิตย์ แต่โบสถ์หลังเก่าจะเปิดต่อเมื่อมีการประกอบพิธีแต่งงาน ใครที่ชอบชมสถาปัตยกรรมเก่าๆ ชอบถ่ายรูป ต้องไม่พลาดแวะมาเที่ยวที่นี่แล้ว",
    "image": "",
    "latitude": "7.6972354",
    "longitude": "99.304743",
    "located": "อำเภอเมืองตรัง",
    "name": "คริสตจักรตรัง",
    "score": 0
  },
  {
    "category": 2,
    "description":
        "\t\tที่สุดของความคลาสสิคเมืองตรัง ก็ต้องยกให้สถานีรถไฟกันตังนี่เลย เป็นสถานีรถไฟสุดทางของทางรถไฟสายใต้ฝั่งทะเลอันดามัน เป็นอาคารไม้ชั้นเดียวทรงปั้นหยา ทาสีเหลืองมัสตาร์ดสลับน้ำตาลผสมผสานศิลปะแบบตะวันออก และตะวันตกเข้าด้วยกัน ได้รับการประกาศขึ้นทะเบียนเป็น โบราณสถานของจังหวัดตรัง จากกรมศิลปากร ตั้งแต่ พ.ศ. 2539",
    "image": "",
    "latitude": "7.4114577",
    "longitude": "99.5175571",
    "located": "ตำบลกันตัง",
    "name": "สถานีรถไฟกันตัง",
    "score": 0
  },
  {
    "category": 2,
    "description":
        "\t\tตลาดกลางคืนชินตา เป็นตลาดเปิดใหม่ของจังหวัดตรัง โดยคำว่าชินตาเป็นภาษามาเลเซียแปลว่าความรัก มีพื้นที่กว้างกว่า 14 ไร่ เหมาะสำหรับใครที่อยากไปเดินหาอะไรทานตอนกลางคืน ที่ชินตานอกจากมีร้านอาหารให้เลือกทานเยอะแล้ว ยังมีร้านแฮ้งค์เอาท์ชิลๆ ให้ไปนั่งแก้เซ็ง",
    "image": "",
    "latitude": "7.5565093",
    "longitude": "99.6117193",
    "located": "ตำบลทับเที่ยง",
    "name": "ตลาดกลางคืนชินตา",
    "score": 0
  },
  {
    "category": 2,
    "description":
        "\t\tพิพิธภัณฑ์พระยารัษฎานุประดิษฐ์มหิศรภักดี ตั้งอยู่ห่างจากเทศบาลเมืองกันตังประมาณ 200 เมตร เป็นจวนเก่าเจ้าเมืองตรัง ผู้มีคุณูปการนำความเจริญมาสู่เมืองตรังในหลายๆ ด้าน โดยเฉพาะการนำต้นยางพาราเข้ามาปลูกในเมืองไทยเป็นครั้งแรก สร้างอาชีพชาวสวนยางให้แก่พี่น้องชาวใต้ ส่งผลให้เศรษฐกิจการส่งออกของไทยดีขึ้นจนทุกวันนี้",
    "image": "",
    "latitude": "7.4077018",
    "longitude": "99.5127547",
    "located": "ตำบลกันตัง",
    "name": "พิพิธภัณฑ์พระยารัษฎานุประดิษฐ์มหิศรภักดี",
    "score": 0
  },
  {
    "category": 2,
    "description":
        "\t\tศาลหลักเมืองตรัง ปัจจุบันตั้งอยู่ที่ตำบลตวนธานี อำเภอกันตัง จังหวัดตรัง สถานที่ตั้งตรงจุดนี้อยู่บริเวณที่ตั้งเมืองเก่า เป็นศาลหลักเมืองเพียงแห่งเดียวในประเทศไทยที่มีวิญญาณอภิบาลเป็นสตรีจึงเรียกกันว่าศาลเจ้าแม่หลักเมือง เป็นที่ยึดเหนี่ยวทางจิตใจของชาวตรังทั่วไป โดยเฉพาะผู้ที่ต้องการมีบุตรยากมักจะมาอธิษฐานขอกับบุตรกับเจ้าแม่หลักเมืองเสมอ",
    "image": "",
    "latitude": "7.5242763",
    "longitude": "99.5577407",
    "located": "ตำบลควนธานี",
    "name": "ศาลหลักเมืองตรัง",
    "score": 0
  },
  //TODO: Resturent
  {
    "category": 3,
    "description":
        "\t\tร้านหมูย่างบ้านบัวบก ร้านหมูย่างที่เปิดมานานกว่า 10 ปี เป็นอีกร้านที่ต้องแวะไปชิมของอร่อยเมืองตรัง ถ้าไปเที่ยวเมืองตรังแล้วไม่ได้ทานหมูย่าง เพื่อนล้อว่าไปไม่ถึงตรังแน่นอนค่ะ ซึ่งรสชาติของหมูย่างเมืองตรัง ออกรสหวานนิดๆ หนังกรอบกรุบๆ ยิ่งได้ทานกับน้ำชาร้อนเข้ากันมาก ..ที่ร้านบ้านบัวบกนอกจากเมนูหมูย่างแล้ว ยังมีเมนูบะหมี่หมูย่าง ข้าวหมูย่าง และติ่มซำอีกด้วย",
    "image": "",
    "latitude": "7.5628218",
    "longitude": "99.6047917",
    "located": "ตำบลทับเที่ยง",
    "name": "ร้านหมูย่าง บ้านบัวบก",
    "score": 0
  },
  {
    "category": 3,
    "description":
        "\t\tหม่าโถว โฮสเทล & คาเฟ่ ที่มาในสไตล์ลูกครึ่งไทย-จีน ผสมกับความสมัยใหม่ และวิธีชีวิตแบบชาวตรังท้องถิ่นได้แบบลงตัว หม่าโถว แปลว่าท่าเรือ ที่เจ้าของพยายามบอกเล่าให้แขกผู้มาเยือนได้รับรู้ถึงวิถีชีวิต และความศรัทธาของชาวกันตังที่มีต่อท้องทะเล และวิถีชีวิตของผู้คนที่อยู่ที่นี่มาอย่างยาวนาน อีกหนึ่งร้านเก๋ ๆ ในอำเภอกันตัง ที่ต้องแวะมานั่งชิลให้ได้ หรือใครที่กำลังมองหาที่พักโฮสเทลสุดชิคที่นี่ก็เหมาะเป็นอย่างยิ่ง แถมราคาก็ยังไม่แพงอีกต่างหาก",
    "image": "",
    "latitude": "7.4117263",
    "longitude": "99.5068476",
    "located": "ตำบลกันตัง",
    "name": "Matou Hostel & Café",
    "score": 0
  },
  {
    "category": 3,
    "description":
        "\t\tร้านกุนเชียงบางรัก ถ้าอยากกินร้านนี้แนะนำให้มาเช้าหน่อย มาแล้วห้ามพลาดปาท่องโก๋ยักษ์คู่ตัวยาวอันเป็นเอกลักษณ์ มาพร้อมสังขยาสีเขียวหวานหอม กินกับข้าวต้มปลา ข้าวต้มหมู หรือข้าวต้มกุ้ง ยิ่งฟิน เมนูอื่นๆ ที่น่าลอง เช่น ขนมจีบ ฮะเก๋า เมนูของทอดอื่น ๆ ส่วนเครื่องดื่ม เช่น ชา กาแฟ โกโก้ ชาเย็น เป็นต้น",
    "image": "",
    "latitude": '7.5447198',
    "longitude": '99.6044698',
    "located": "อำเภอเมือง",
    "name": "ร้านกุนเชียงบางรัก",
    "score": 0
  },
  {
    "category": 3,
    "description":
        "\t\tร้านอาหารสีฟ้า ไลฟ์สไตล์ฟู้ดตรัง ที่นี่มีเมนูอาหารให้เลือกเยอะมากๆ ทั้งคาวหวาน อาหารคาว เช่น แกงส้มปูนิ่ม แกงส้มปลากระบอก ปลาทรายทอดขมิ้น น้ำพริกกุ้งเสียบ ยำถั่วพู หัวปลาต้มเผือก ส่วนขนมหวาน เช่น ไอศกรีมธัญพืช เป็นต้น ใครมาเที่ยวตรังแล้วอยากกินเมนูพื้นบ้านอาหารพื้นเมืองต้องแวะมาร้านนี้เลย",
    "image": "",
    "latitude": "7.5588643",
    "longitude": "99.6095239",
    "located": "อำเภอเมือง",
    "name": "ร้านอาหารสีฟ้า ไลฟ์สไตล์ฟู้ดตรัง",
    "score": 0
  },
  {
    "category": 3,
    "description":
        "\t\tร้านจีบขาว ร้านอาหารเก่าแก่ในจังหวัดตรัง เปิดมานานกว่า 80 ปีแล้วค่ะร้านนี้ เป็นร้านอาหารเช้าที่มีเมนูหลากหลายมากก ทั้งติ่มซำ กาแฟ ก๋วยเตี๋ยว อาหารเช้าอื่นๆ และยังมีเมนูพิเศษอีกมากมายอีกด้วย ซึ่งทุกๆ เมนูทางร้านก็ยังทำเองทุกอย่างค่ะ อร่อยเด็ดทุกเมนูแน่นอน ใครอยากฝากท้องในยามเช้า บอกเลยว่ามาร้านนี้ครบจบในร้านเดียว!!",
    "image": "",
    "latitude": "7.559438",
    "longitude": "99.6056411",
    "located": "อำเภอเมือง",
    "name": "จีบขาว",
    "score": 0
  },
  //TODO: Hotel
  {
    "category": 4,
    "description":
        "\t\tโรงแรมเฌอแตม อีกหนึ่งที่พักตรังทำเลดีตั้งอยู่ใจกลางเมือง หาได้ไม่ยากเพราะตั้งอยู่ใกล้สี่แยก นักท่องเที่ยวจึงสามารถเดินทางไปเที่ยวสถานที่ท่องเที่ยวต่าง ๆ ในเมืองได้อย่างสบาย ๆ หากใครต้องการจะปั่นรถจักรยานไปเที่ยวเองก็สามารถขอเช่าจากทางโรงแรมได้ หรือหากเน้นความเร็วก็สามารถออกมายืนรอโบกวินมอเตอร์ไซด์ด้านหน้าโรงแรมได้เลย ภายในห้องพักค่อนข้างกว้างขวาง ใหม่ และสะอาด ตกแต่งอย่างสวยงามในบรรยากาศอบอุ่นและเป็นกันเอง คุ้มค่าเกินราคาที่จ่ายไปด้วยสิ่งอำนวยความสะดวกครบครันภายในห้องพักและได้รับการบริการคุณภาพเลิศจากพนักงานที่สุดแสนอัธยาศัยดี ห้องพักมีระเบียง สามารถออกไปชมวิวเมืองยามเช้าและยามเย็นสวย ๆ ได้ ขอบอกอีกนิดว่าที่นี่ยังมีบริการนวดและรูมเซอร์วิส 24 ชั่วโมงด้วยนะ",
    "image": "",
    "latitude": "7.5475871",
    "longitude": "99.6157107",
    "located": "อำเภอเมือง",
    "name": "โรงแรมเฌอแตม ตรัง",
    "score": 0
  },
  {
    "category": 4,
    "description":
        "\t\tMitree house ที่พักตรังราคาหลักร้อย ทำเลที่ตั้งดีอยู่ใจกลางเมือง ใกล้สถานีรถไฟ ร้านอาหารท้องถิ่นอร่อย ๆ หลายร้าน และใกล้สถานที่ท่องเที่ยวในเมืองหลายแห่ง เช่น หอนาฬิกา ถนนคนเดิน และสวนสาธารณะพระยารัษฎานุประดิษฐ์มหิศรภักดี ภายในอาคารที่พักตกแต่งผสมผสานระหว่างบรรยากาศเก่าและใหม่ไว้ด้วยกัน โดดเด่นที่สถาปัตยกรรมท้องถิ่น ยังคงกลิ่นอายความดั้งเดิมของเมืองตรังได้อย่างดีเยี่ยม เหมือนได้กลับมาพักผ่อนที่บ้านหลังเก่าแสนอบอุ่นอีกครั้ง เพิ่มบรรยากาศน่ารัก ๆ ด้วยดอกไม้ ภาพถ่ายโบราณ และเก้าอี้นั่งเล่นสุดคลาสสิก ภายในห้องพักตกแต่งในโทนอบอุ่นเน้นสีขาวหรือสีโทนสว่างเป็นหลัก พร้อมไปด้วยสิ่งอำนวยความสะดวกครบครัน เตียงนอนสบาย ภายในห้องสะอาดและมีความเป็นส่วนตัวสูง เหมาะสำหรับคนที่ต้องการพักในสไตล์บ้านท้องถิ่นเป็นอย่างมาก",
    "image": "",
    "latitude": "7.5548271",
    "longitude": "99.6051907",
    "located": "อำเภอเมือง",
    "name": "Mitree House",
    "score": 0
  },
  {
    "category": 4,
    "description":
        "\t\tMaison de CHEER หรือ เมซอง เดอ เชียร์ ที่พักตรังอันสุดแสนสบายที่ตั้งอยู่ใจกลางเมือง เหมาะสำหรับนักท่องเที่ยวที่ต้องการเดินทางไปไหนมาไหนสะดวก ที่นี่ตั้งอยู่ห่างจากสถานีรถไฟตรังเพียงแค่ 200 เมตร และสามารถขับรถไปถึงสนามบินได้ภายใน 15 นาทีเท่านั้น บรรยากาศภายนอกรายล้อมไปด้วยร้านอาหารท้องถิ่นที่เปิดมานานหลายสิบปี นักท่องเที่ยวจะได้สัมผัสถึงวิถีชีวิตคนเมืองตรังแบบดั้งเดิม สามารถเดินไปกินติ่มซำยามเช้า และเดินเที่ยวถนนคนเดินยามค่ำคืนได้อย่างสบาย ๆ ส่วนบรรยากาศภายในโรงแรมนั้นก็สุดแสนจะอบอุ่น เพราะเจ้าของตั้งใจตกแต่งบรรยากาศให้เปรียบเสมือนบ้านอีกหลังของผู้เข้าพักที่เต็มไปด้วยสิ่งอำนวยความสะดวกมากมาย ความโดดเด่นอยู่ตรงที่ห้องพักทุกห้องตกแต่งในโทนสว่างสดใส ทำให้ผู้เข้าพักรู้สึกโปร่งและโล่งสบาย มีระเบียงส่วนตัวสามารถมองเห็นวิวเมืองตรังได้ด้วย ที่นี่มีบริการอาหารเช้าโดยจ่ายเพิ่มแค่ 100 บาทต่อห้องเท่านั้น นอกจากนี้ยังมีบริการรถเช่าเพื่อขับท่องเที่ยวภายในจังหวัดและบริการรถรับ-ส่งด้วย",
    "image": "",
    "latitude": "7.5554682",
    "longitude": "99.6009455",
    "located": "อำเภอเมือง",
    "name": "Maison de CHEER",
    "score": 0
  },
  {
    "category": 4,
    "description":
        "\t\tอีกหนึ่งที่พักตรังทำเลดีที่เราอยากแนะนำ สิริตรัง บูทีค ที่พักสุดแสนสบายที่ตั้งอยู่ติดกับย่านธุรกิจใจกลางเมืองตรัง ผู้เข้าพักสามารถเดินทางไปแหล่งท่องเที่ยวต่าง ๆ ได้ง่าย ๆ ใกล้แหล่งกินแหล่งช็อปสุดฮิตใจกลางเมือง ที่นี่เปิดบริการห้องพักทั้งหมด 36 ห้อง เต็มไปด้วยสิ่งอำนวยความสะดวกครบครัน เน้นการตกแต่งสไตล์ Loft อันเรียบง่ายและทันสมัย มีบริการที่จอดรถฟรี มีห้องอาหารไว้สำหรับทานอาหารเช้า และมีมินิบาร์ฟรีตลอดทั้งวัน ทั้งยังมีบริการเสริมเรียกรถรับ-ส่งสนามบินให้แขกผู้เข้าพัก และบริการเช่ารถขับเที่ยวด้วย",
    "image": "",
    "latitude": "7.5668961",
    "longitude": "99.6322072",
    "located": "อำเภอเมือง",
    "name": "สิริตรัง บูทีค",
    "score": 0
  },
  {
    "category": 4,
    "description":
        "\t\tนกฮูก เฮาส์ ที่พักตรังแนวโฮสเทลที่ตั้งอยู่ใจกลางเมืองใกล้วงเวียนพะยูน นักท่องเที่ยวที่เข้าพักสามารถเดินทางไปไหนมาไหนในเมืองได้สะดวก บรรยากาศภายในสถานที่ตกแต่งด้วยสไตล์ Loft สุดชิคและทันสมัย ห้องพักที่เปิดให้บริการมีทั้งห้องพักแบบส่วนตัวและห้องพักนอนรวม Dormitory เหมาะกับนักท่องเที่ยวแบคแพคเกอร์แบบกรุ๊ปใหญ่ ภายในห้องพักสะอาด กว้างขวาง เตียงนอนสบาย แอร์เย็นฉ่ำ มีสิ่งอำนวยความสะดวกครบครัน และมี Wi-Fi ฟรีให้ใช้ด้วย",
    "image": "",
    "latitude": "7.5624056",
    "longitude": "99.6105185",
    "located": "สิริตรัง บูทีค",
    "name": "นกฮูก เฮาส์",
    "score": 0
  },
];

List<String> images = [
  // TODO: Beach
  "libong_island.jpg",
  "kradan_island.jpg",
  "pakmeng_beach.jpg",
  "ngai_island.jpg",
  "yongLing_beach.jpg",
  // TODO: Forest
  "leKhaoKop_cave.jpg",
  "khao-jom-pa.jpeg",
  "Thungkai-Botanic-Garden.png",
  "chang-lost _cave.jpg",
  "Wangpamek.jpg",
  // TODO: City
  "Trang-Church.jpg",
  "Kantang-Railway-Station.jpg",
  "Cinta-garden_night-market.jpg",
  "Radsada_Museum.jpg",
  "Trang-City-Pillar.png",
  // TODO: Resturent
  "บ้านบัวบก.jpg",
  "Matou_Hostel.jpg",
  "ร้านกุนเชียงบางรัก.webp",
  "ร้านอาหารสีฟ้า.webp",
  "จีบขาว.jpg",
  // TODO: Hotel
  "โรงแรมเฌอแตม.webp",
  "Mitree_House.webp",
  "Maison_de_CHEER.webp",
  "สิริตรังบูทีค.webp",
  "นกฮูกเฮาส์.webp",
];
